FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_СписокКонстантныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БТ_СписокКонстантныхЗначений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/БТ_СписокКонстантныхЗначений/Ext/ManagerModule.bsl
//БИЗТЕХ КОВАЛЬ 16.07.2025 ++

// Функция - Получить таблицу константы
//
// Параметры:
//  НаименованиеКонстантногоЗначения - Наименование константного значения в виде строки
// 
// Возвращаемое значение:
//   - Таблица значений
//
Функция ПолучитьТаблицуКонстанты(НаименованиеКонстантногоЗначения) Экспорт
	СсылкаНаЭлемент = Справочники.БТ_СписокКонстантныхЗначений.НайтиПоНаименованию(НаименованиеКонстантногоЗначения,Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка КАК Ссылка,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.НомерСтроки КАК НомерСтроки,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Значение,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение1,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК Значение2,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение3 КАК Значение3,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение4 КАК Значение4
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЭлемент);
	
	Возврат Запрос.Выполнить().Выгрузить();

Конецфункции

// Функция - Есть ли значение в таблице
// Выполняет проверку на существование значения в определенной колонке в определенном элементе справочника
// Параметры:
//  НаименованиеКонстантногоЗначения - Наименование константного значения в виде строки - Строка
//  НаименованиеКолонки				 - Наименование колонки в таблице. Первая колонка "Значение", вторая "Значение1", последняя "Значение4" - Строка 
//  Значение						 - Значение которое нужно найти в указанной колонке - Любой
// 
// Возвращаемое значение:
//  Если значение есть в колонке то возвращается ИСТИНА, в противном случае ЛОЖЬ - Булево
//
Функция ЕстьЛиЗначениеВТаблице(НаименованиеКонстантногоЗначения,НаименованиеКолонки,Значение) Экспорт 
	
	ТаблицаДЛяПоиска = ПолучитьТаблицуКонстанты(НаименованиеКонстантногоЗначения);
	
	СтруктураПоиска = новый Структура;
	СтруктураПоиска.Вставить(НаименованиеКолонки,Значение);
	
	Если ТаблицаДЛяПоиска.НайтиСтроки(СтруктураПоиска).Количество() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//БИЗТЕХ КОВАЛЬ 16.07.2025 --

//БИЗТЕХ КОВАЛЬ 25.11.2025 ++
Функция ПолучитьЗначениеКонстанты(НаименованиеКонстантногоЗначения,НаименованиеКолонки) Экспорт

	СсылкаНаЭлемент = Справочники.БТ_СписокКонстантныхЗначений.НайтиПоНаименованию(НаименованиеКонстантногоЗначения,Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка = &Ссылка
		|	И БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение = &НаименованиеКолонки";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЭлемент);
	Запрос.УстановитьПараметр("НаименованиеКолонки", НаименованиеКолонки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Значение;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции	
//БИЗТЕХ КОВАЛЬ 25.11.2025 --


Функция ПодразделениеО2Ли(Подразделение) Экспорт
	
	Возврат ЕстьЛиЗначениеВТаблице("ПодразделенияО2","Значение",Подразделение);
	
КонецФункции
